In [2]:
import pandas as pd

In [5]:
groceries = pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread'])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [6]:
groceries.shape

(4,)

In [7]:
groceries.ndim

1

In [8]:
groceries.size

4

In [9]:
groceries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [10]:
groceries.values

array([30, 6, 'Yes', 'No'], dtype=object)

In [11]:
'banana' in groceries.index

False

In [12]:
'bread' in groceries.index

True

In [16]:
groceries['eggs']

30

In [17]:
groceries[['milk','bread']]

milk     Yes
bread     No
dtype: object

In [19]:
groceries[0]
groceries[-1]
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [20]:
groceries.loc[['eggs','apples']]

eggs      30
apples     6
dtype: object

In [21]:
groceries.iloc[[2,3]]

milk     Yes
bread     No
dtype: object

In [23]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [25]:
groceries['eggs'] = 2
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [27]:
groceries.drop('apples', inplace=True)

In [29]:
groceries

eggs       2
milk     Yes
bread     No
dtype: object

In [30]:
fruits = pd.Series([10,6,3],['apples','oranges','bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [31]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [32]:
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [33]:
import numpy as np

In [34]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [35]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [36]:
np.power(fruits,2)

apples     100
oranges     36
bananas      9
dtype: int64

In [37]:
fruits['bananas'] + 2

5

In [38]:
fruits[['apples','oranges']]/2

apples     5.0
oranges    3.0
dtype: float64

In [39]:
distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]
planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']
dist_planets = pd.Series(distance_from_sun, planets)
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [41]:
time_light = dist_planets / 18
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [42]:
close_planets = time_light[time_light < 40]
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

In [43]:
items = {'Bob': pd.Series([245, 25, 55],['bike','pants','watch']), 
         'Alice': pd.Series([40,110,500,45],['book','glasses','bike','pants'])}
type(items)

dict

In [44]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [46]:
data = {'Bob': pd.Series([245, 25, 55]),'Alice': pd.Series([40,110,500,45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [47]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [48]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [49]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [50]:
shopping_carts.shape

(5, 2)

In [52]:
shopping_carts.ndim

2

In [53]:
shopping_carts.size

10

In [54]:
bob_shopping_cart = pd.DataFrame(items,columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [55]:
sel_shopping_cart = pd.DataFrame(items,['pants','book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [56]:
alice_sel_shopping_cart = pd.DataFrame(items, ['glasses','bike'],columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [60]:
items = [{'bikes': 20, 'pants': 30, 'watches':35},{'watches': 10,'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [61]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [62]:
store_items[['bikes','pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [64]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [65]:
store_items['bikes']['store 2']

15

In [66]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [67]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items,['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [68]:
store_items = store_items.append(new_store)
store_items

/Users/rchint1/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

         bikes  glasses  pants  shirts  watches
store 1     20      NaN     30    15.0       35
store 2     15     50.0      5     2.0       10
store 3     20      4.0     30     NaN       35

In [69]:
store_items.insert(5, 'shoes', [8, 5, 0])
store_items

         bikes  glasses  pants  shirts  watches  shoes
store 1     20      NaN     30    15.0       35      8
store 2     15     50.0      5     2.0       10      5
store 3     20      4.0     30     NaN       35      0

In [70]:
store_items = store_items.drop(['watches'],axis=1)
store_items

         bikes  glasses  pants  shirts  shoes
store 1     20      NaN     30    15.0      8
store 2     15     50.0      5     2.0      5
store 3     20      4.0     30     NaN      0

In [71]:
store_items = store_items.drop(['store 1'], axis=0)
store_items

         bikes  glasses  pants  shirts  shoes
store 2     15     50.0      5     2.0      5
store 3     20      4.0     30     NaN      0

In [72]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  shoes
store 2    15     50.0      5     2.0      5
store 3    20      4.0     30     NaN      0

In [74]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  shoes
store 2       15     50.0      5     2.0      5
last store    20      4.0     30     NaN      0

In [77]:
x = store_items.isnull().sum().sum()
x

1

In [78]:
store_items.count()

hats       2
glasses    2
pants      2
shirts     1
shoes      2
dtype: int64

In [79]:
store_items.fillna(0)

            hats  glasses  pants  shirts  shoes
store 2       15     50.0      5     2.0      5
last store    20      4.0     30     0.0      0

In [81]:
pd.set_option('precision', 1)
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

dat = {'Author': authors, 'Book Title': books, 'user 1': user_1, 'user 2': user_2, 'user 3': user_3, 'user 4': user_4}
book_ratings = pd.DataFrame(dat)
book_ratings

                Author           Book Title  user 1  user 2  user 3  user 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

In [87]:
book_ratings.fillna(book_ratings.mean(), axis=0)

                Author           Book Title  user 1  user 2  user 3  user 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

In [88]:
Google_stock = pd.read_csv('./GOOG.csv')
type(Google_stock)
Google_stock.shape

(3313, 7)

In [89]:
Google_stock

            Date   Open   High    Low  Close  Adj Close    Volume
0     2004-08-19   49.7   51.7   47.7   49.8       49.8  44994500
1     2004-08-20   50.2   54.2   49.9   53.8       53.8  23005800
2     2004-08-23   55.0   56.4   54.2   54.3       54.3  18393200
3     2004-08-24   55.3   55.4   51.5   52.1       52.1  15361800
4     2004-08-25   52.1   53.7   51.6   52.7       52.7   9257400
...          ...    ...    ...    ...    ...        ...       ...
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0    891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6    968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2   1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8   1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7   1157700

[3313 rows x 7 columns]

In [90]:
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [92]:
Google_stock.tail(2)

            Date   Open   High    Low  Close  Adj Close   Volume
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

In [93]:
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [94]:
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [95]:
Google_stock.max()
Google_stock.mean()

Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

In [96]:
Google_stock['Close'].min()

49.681866

In [97]:
Google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0